-- 插入学校
INSERT INTO
    schools (name)
VALUES
    ('百鬼夜行'),
    ('レッドウィンター'),
    ('トリニティ'),
    ('ゲヘナ'),
    ('アビドス'),
    ('ミレニアム'),
    ('アリウス'),
    ('山海経'),
    ('ヴァルキューレ'),
    ('SRT'),
    ('その他');

-- 插入礼物
-- 通常贈り物（例：ぬいぐるみ）
INSERT INTO
    gifts (
        name,
        category,
        grade,
        bond_point_small,
        bond_point_medium,
        bond_point_large,
        bond_point_extra
    )
VALUES
    ('ぬいぐるみ', '人形', '通常', 20, 40, 60, 80);

-- 普通贈り物
INSERT INTO
    normal_gift (
        type,
        bond_point_small,
        bond_point_medium,
        bond_point_large,
        bond_point_extra
    )
VALUES
    ("通常贈り物", 20, 40, 60, 80)
    -- 高級贈り物
INSERT INTO
    luxury_gift (
        type,
        bond_point_small,
        bond_point_medium,
        bond_point_large,
        bond_point_extra
    )
VALUES
    ("高級贈り物", null, 120, 180, 240)
    -- 高級贈り物（例：高級チョコ）
INSERT INTO
    gifts (
        name,
        category,
        grade,
    )
VALUES
    ('高級チョコレート', 'お菓子', '高級', NULL, 120, 180, 240);

-- 插入角色
INSERT INTO
    student (
        name_jp,
        name_en,
        name_zh_CN,
        name_zh_TW,
        school_id,
        gift_id,
        role_type,
        position,
        rarity,
        release_date
    )
VALUES
    (
        'ハナコ（水着）',
        'Hanako (Swimsuit)',
        '泳装花子',
        '泳裝花子',
        1,
        1,
        '攻撃型',
        '後衛',
        3,
        '2021-08-10'
    );

-- INSERT INTO
--     exp_reports (name, exp_value)
-- VALUES
--     ("初級レポート", 50),
--     ("中級レポート", 500),
--     ("上級レポート", 2000),
--     ("最上級レポート", 10000);

-- INSERT INTO
--     student_exp_requirements (level, total_exp, exp_to_next)
-- VALUES
--     (1, 0, 14),
--     (2, 14, 30),
--     (3, 44, 46),
--     (4, 90, 64),
--     (5, 154, 85),
--     (6, 239, 110),
--     (7, 349, 138),
--     (8, 487, 170),
--     (9, 657, 205),
--     (10, 862, 244),
--     (11, 1106, 288),
--     (12, 1394, 335),
--     (13, 1729, 388),
--     (14, 2117, 444),
--     (15, 2561, 506),
--     (16, 3067, 573),
--     (17, 3640, 646),
--     (18, 4286, 725),
--     (19, 5011, 810),
--     (20, 5821, 902),
--     (21, 6723, 1001),
--     (22, 7724, 1105),
--     (23, 8829, 1218),
--     (24, 10047, 1338),
--     (25, 11385, 1466),
--     (26, 12851, 1601),
--     (27, 14452, 1745),
--     (28, 16197, 1897),
--     (29, 18094, 2059),
--     (30, 20153, 2231),
--     (31, 22384, 2413),
--     (32, 24797, 2602),
--     (33, 27399, 2798),
--     (34, 30197, 3002),
--     (35, 33199, 3216),
--     (36, 36415, 3439),
--     (37, 39854, 3671),
--     (38, 43525, 3912),
--     (39, 47437, 4163),
--     (40, 51600, 4424),
--     (41, 56024, 4695),
--     (42, 60719, 4976),
--     (43, 65695, 5268),
--     (44, 70963, 5571),
--     (45, 76534, 5886),
--     (46, 82420, 6112),
--     (47, 88532, 6349),
--     (48, 94881, 6598),
--     (49, 101479, 6858),
--     (50, 108337, 7130),
--     (51, 115467, 7414),
--     (52, 122881, 7709),
--     (53, 130590, 8016),
--     (54, 138606, 8335),
--     (55, 146941, 8665),
--     (56, 155606, 9008),
--     (57, 164614, 9362),
--     (58, 173976, 9728),
--     (59, 183704, 10106),
--     (60, 193810, 10496),
--     (61, 204306, 10898),
--     (62, 215204, 11312),
--     (63, 226516, 11738),
--     (64, 238254, 12176),
--     (65, 250430, 12626),
--     (66, 263056, 13088),
--     (67, 276144, 13562),
--     (68, 289706, 14048),
--     (69, 303754, 14546),
--     (70, 318300, 15056),
--     (71, 333356, 15578),
--     (72, 348934, 16112),
--     (73, 365046, 16658),
--     (74, 381704, 17216),
--     (75, 398920, 17786),
--     (76, 416706, 18368),
--     (77, 435074, 18962),
--     (78, 454036, 19568),
--     (79, 473604, 20186),
--     (80, 493790, 20816),
--     (81, 514606, 21458),
--     (82, 536064, 22112),
--     (83, 558176, 22778),
--     (84, 580954, 23456),
--     (85, 604410, 24146),
--     (86, 628556, NULL);

-- INSERT INTO
--     level_requirements (level, exp_books, credits)
-- VALUES
--     (91, 10, 10000),
--     (92, 12, 12000),
--     (93, 14, 14000),
--     (94, 16, 16000),
--     (95, 18, 18000),
--     (96, 20, 20000),
--     (97, 22, 22000),
--     (98, 24, 24000),
--     (99, 26, 26000),
--     (100, 28, 28000);

-- -- 插入角色状态
-- INSERT INTO
--     student_stats (student_id, hp, atk, heal, def)
-- VALUES
--     (1, 52908, 7937, 5948, 109);

-- -- 插入角色技能
-- INSERT INTO
--     student_skills (student_id, skill_type, level, is_max)
-- VALUES
--     (1, 'EX', 10, TRUE),
--     (1, 'ノーマル', 10, TRUE),
--     (1, 'パッシブ', 10, TRUE),
--     (1, 'サブ', 10, TRUE);

-- -- 插入装备
-- INSERT INTO
--     student_equipment (student_id, slot, name, tier, is_enhanced)
-- VALUES
--     (1, 1, 'アタッカー用ヘッドセット', 10, TRUE),
--     (1, 2, '攻撃型腕輪', 10, TRUE),
--     (1, 3, 'EX回路制御デバイス', 9, TRUE);

-- -- 插入固有武器
-- INSERT INTO
    student_weapon (student_id, name, level, star_rating)
VALUES
    (1, 'ピンクアサルトAR', 50, 3);